//------------------------------------------------------USERS-------------------------------------------------------
//==================================================================================================================
// Регистрация пользователя
// POST /auth/register
/* 
  request body:
    {
      email: string;
      firstName: string;
      lastName: string;
      password: string;
      avatar?: string;
    }
    +=
    {
      system _id: string;
      system createdAt: string;
    }
    +=
    {
      postsCount: number; {initial value 0}
      subscribersCount: number; {initial value 0}
    }

  response:
    {
      id: string;
      email: string;
    }
*/
//==================================================================================================================
// Авторизация пользователя
// POST /auth/login
/* 
  request body:
    {
      email: string;
      password: string;
    }

  response:
    {
      token: string;
    }
*/
//==================================================================================================================
// Проверка авторизации пользователя
// GET /auth/login
/* 
  response:
    {
      email: string;
      firstName: string;
      lastName: string;
      password: string;
      avatar: string;
    }
*/
//==================================================================================================================
// Изменение пароля
// PATCH /auth/passchange
/* 
  request body:
    {
      currentPassword: string;
      newPassword: string;
    }

  response: ???????????????????????????????????????????????????????????????????????????????????????????????????????
*/
//==================================================================================================================
// Получение детальной информации о пользователе (имплементировать только в auth ?)
// GET /auth/:userId
/* 
  response:
    {
      createdAt: string;
      postsCount: number;
      subscribersCount: number;
      id: string;
    }
*/
//==================================================================================================================
// Подписка на пользователя
// POST /users/:userId/subscribe
//==================================================================================================================
// Отписка от пользователя
// POST /users/:userId/unsubscribe
//==================================================================================================================
